3/ruby_request_with_digest.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:wsdl="http://pmc" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://pmc">
  <env:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="UsernameToken-1">
        <wsse:Username>lunacik</wsse:Username>
        <wsse:Nonce>eef8b2c96d53f23b669f3a517527f9418097c15b</wsse:Nonce>
        <wsu:Created>2012-05-24T15:21:01+03:00</wsu:Created>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">MjFhZDc3MDlhYzdkMThiOWFkNjBmZThkZmFkZmQ5OTBhZTM5ZGJlMA==</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </env:Header>
  <env:Body>
    <ins0:checkIfRegistered/>
  </env:Body>
</env:Envelope>
